{
  "backend/main.mo": "Actor defining storage, authorization, sitemap serving, and data models for applications, contacts, gallery items, and user profiles.",
  "feature_evidence.json": "JSON report listing feature requirements, missing frontend config module, and admin login error handling update.",
  "frontend-file-summaries.txt": "Prewritten summaries of all major frontend files including components, pages, hooks, and configurations.",
  "frontend/index.css": "Tailwind base and custom CSS variables defining light/dark themes using OKLCH color values.",
  "frontend/index.html": "HTML entry point with SEO meta tags, Google verification, and root mounting for the React app.",
  "frontend/src/App.tsx": "Main React app wiring with TanStack Router, query client, theme provider, and Internet Identity provider.",
  "frontend/src/components/About.tsx": "About section showing company features, services list, and styled cards with icons and images.",
  "frontend/src/components/ApplicationForm.tsx": "Handles application form input, file uploads with progress, validation, and submission via a mutation hook.",
  "frontend/src/components/Benefits.tsx": "Displays a grid of solar energy benefits with icons, descriptions, and a supporting image.",
  "frontend/src/components/Contact.tsx": "Implements a contact form with validation and submission plus static contact details like phone, email, and address.",
  "frontend/src/components/FiveKwSystem.tsx": "Shows details, features, benefits, and suitability info for a 5kW rooftop solar system with supporting visuals.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with logo, slogan, copyright, and a credit link.",
  "frontend/src/components/Gallery.tsx": "Fetches and displays gallery items or fallback images in a responsive grid with loading skeletons.",
  "frontend/src/components/Header.tsx": "Responsive header with navigation, theme toggle, scrolling to sections, and admin/blog routing.",
  "frontend/src/components/Hero.tsx": "Hero section with background image, brand intro, CTAs scrolling to form/contact, and stats display.",
  "frontend/src/components/PmSuryaScheme.tsx": "Section explaining PM Surya Ghar scheme with eligibility, documents, subsidy info, and process steps.",
  "frontend/src/components/PromotionalPopup.tsx": "Timed or scroll-triggered popup promoting a free site survey with close and CTA actions.",
  "frontend/src/components/SEOHead.tsx": "Utility component dynamically updating page title, meta tags, Open Graph/Twitter tags, and structured data.",
  "frontend/src/components/Services.tsx": "Services section listing installation, maintenance, consultation, and green energy offerings with images.",
  "frontend/src/components/VideoSection.tsx": "Renders a video preview section with a thumbnail, play button, and three statistic cards.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refreshing dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication using AuthClient with stored identity support.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for backend data and includes mock blog post data until backend support exists.",
  "frontend/src/index.css": "Tailwind-based global styles defining solar-themed color variables, dark mode, gradients, and blog prose styling.",
  "frontend/src/main.tsx": "Application entry point setting up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page that handles login, role checks, sorting, filtering, and displaying PM Surya Ghar applications.",
  "frontend/src/pages/BlogDetailPage.tsx": "Displays a full blog post with SEO data, sharing options, and related posts, handling loading and not-found states.",
  "frontend/src/pages/BlogListPage.tsx": "Shows a searchable, filterable list of blog posts with tags, SEO metadata, and navigation to post details.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage layout including hero, services, gallery, contact sections, and SEO structured data.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, storing, and clearing URL and session parameters, supporting hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, animations, and plugin usage.",
  "project_state.json": "Contains project metadata, current issues, and required feature fixes related to Internet Identity login."
}